zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/include/pic32cz2051ca70064.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if !defined DONT_USE_PREDEFINED_CORE_HANDLERS
/* CORTEX-M7 exception handlers */
void Reset_Handler                 ( void );
void NonMaskableInt_Handler        ( void );
void HardFault_Handler             ( void );
void MemoryManagement_Handler      ( void );
void BusFault_Handler              ( void );
void UsageFault_Handler            ( void );
void SVCall_Handler                ( void );
void DebugMonitor_Handler          ( void );
void PendSV_Handler                ( void );
void SysTick_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_CORE_HANDLERS */

#if !defined DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS
/* Peripherals interrupt handlers */
void SUPC_Handler                  ( void );
void RSTC_Handler                  ( void );
void RTC_Handler                   ( void );
void RTT_Handler                   ( void );
void WDT_Handler                   ( void );
void PMC_Handler                   ( void );
void EFC_Handler                   ( void );
void UART0_Handler                 ( void );
void UART1_Handler                 ( void );
void PIOA_Handler                  ( void );
void PIOB_Handler                  ( void );
void USART0_Handler                ( void );
void USART1_Handler                ( void );
void PIOD_Handler                  ( void );
void TWIHS0_Handler                ( void );
void TWIHS1_Handler                ( void );
void SSC_Handler                   ( void );
void TC0_CH0_Handler               ( void );
void TC0_CH1_Handler               ( void );
void TC0_CH2_Handler               ( void );
void TC1_CH0_Handler               ( void );
void TC1_CH1_Handler               ( void );
void TC1_CH2_Handler               ( void );
void AFEC0_Handler                 ( void );
void DACC_Handler                  ( void );
void PWM0_Handler                  ( void );
void ICM_Handler                   ( void );
void ACC_Handler                   ( void );
void USBHS_Handler                 ( void );
void MCAN0_INT0_Handler            ( void );
void MCAN0_INT1_Handler            ( void );
void GMAC_Handler                  ( void );
void AFEC1_Handler                 ( void );
void QSPI_Handler                  ( void );
void UART2_Handler                 ( void );
void TC2_CH0_Handler               ( void );
void TC2_CH1_Handler               ( void );
void TC2_CH2_Handler               ( void );
void TC3_CH0_Handler               ( void );
void TC3_CH1_Handler               ( void );
void TC3_CH2_Handler               ( void );
void MLB_Handler                   ( void );
void AES_Handler                   ( void );
void TRNG_Handler                  ( void );
void XDMAC_Handler                 ( void );
void ISI_Handler                   ( void );
void PWM1_Handler                  ( void );
void FPU_Handler                   ( void );
void RSWDT_Handler                 ( void );
void CCW_Handler                   ( void );
void CCF_Handler                   ( void );
void GMAC_Q1_Handler               ( void );
void GMAC_Q2_Handler               ( void );
void IXC_Handler                   ( void );
void GMAC_Q3_Handler               ( void );
void GMAC_Q4_Handler               ( void );
void GMAC_Q5_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* Configuration of the CORTEX-M7 Processor and Core Peripherals */
#define __CM7_REV                     0x0101 /* CM7 Core Revision                                                         */
#define __NVIC_PRIO_BITS                   3 /* Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig             0 /* Set to 1 if different SysTick Config is used                              */
#define __MPU_PRESENT                      1 /* MPU present or not                                                        */
#define __VTOR_PRESENT                     1 /* Vector Table Offset Register present or not                               */
#define __FPU_PRESENT                      1 /* FPU present or not                                                        */
#define __FPU_DP                           1 /* Double Precision FPU                                                      */
#define __ICACHE_PRESENT                   1 /* Instruction Cache present                                                 */
#define __DCACHE_PRESENT                   1 /* Data Cache present                                                        */
#define __ITCM_PRESENT                     1 /* Instruction TCM present                                                   */
#define __DTCM_PRESENT                     1 /* Data TCM present                                                          */
#define __DEBUG_LVL                        1
#define __TRACE_LVL                        1
#define __ARCH_ARM                         1
#define __ARCH_ARM_CORTEX_M                1

/* CMSIS includes */
#include "core_cm7.h"
#if defined USE_CMSIS_INIT
#include "system_pic32czca70.h"
#endif /* USE_CMSIS_INIT */

/* ************************************************************************** */
/*         SOFTWARE PERIPHERAL API DEFINITIONS FOR PIC32CZ2051CA70064         */
/* ************************************************************************** */
#include "component/acc.h"
#include "component/aes.h"
#include "component/afec.h"
#include "component/chipid.h"
#include "component/dacc.h"
#include "component/efc.h"
#include "component/fuses.h"
#include "component/gmac.h"
#include "component/gpbr.h"
#include "component/icm.h"
#include "component/isi.h"
#include "component/matrix.h"
#include "component/mcan.h"
#include "component/mlb.h"
#include "component/pio.h"
#include "component/pmc.h"
#include "component/pwm.h"
#include "component/qspi.h"
#include "component/rstc.h"
#include "component/rswdt.h"
#include "component/rtc.h"
#include "component/rtt.h"
#include "component/ssc.h"
#include "component/supc.h"
#include "component/tc.h"
#include "component/trng.h"
#include "component/twihs.h"
#include "component/uart.h"
#include "component/usart.h"
#include "component/usbhs.h"
#include "component/utmi.h"
#include "component/wdt.h"
#include "component/xdmac.h"

/* ************************************************************************** */
/*                INSTANCE DEFINITIONS FOR PIC32CZ2051CA70064                 */
/* ************************************************************************** */
#include "instance/acc.h"
#include "instance/aes.h"
#include "instance/afec0.h"
#include "instance/afec1.h"
#include "instance/chipid.h"
#include "instance/dacc.h"
#include "instance/efc.h"
#include "instance/fuses.h"
#include "instance/gmac.h"
#include "instance/gpbr.h"
#include "instance/icm.h"
#include "instance/isi.h"
#include "instance/matrix.h"
#include "instance/mcan0.h"
#include "instance/mlb.h"
#include "instance/pioa.h"
#include "instance/piob.h"
#include "instance/piod.h"
#include "instance/pmc.h"
#include "instance/pwm0.h"
#include "instance/pwm1.h"
#include "instance/qspi.h"
#include "instance/rstc.h"
#include "instance/rswdt.h"
#include "instance/rtc.h"
#include "instance/rtt.h"
#include "instance/ssc.h"
#include "instance/supc.h"
#include "instance/tc0.h"
#include "instance/tc1.h"
#include "instance/tc2.h"
#include "instance/tc3.h"
#include "instance/trng.h"
#include "instance/twihs0.h"
#include "instance/twihs1.h"
#include "instance/uart0.h"
#include "instance/uart1.h"
#include "instance/uart2.h"
#include "instance/usart0.h"
#include "instance/usart1.h"
#include "instance/usbhs.h"
#include "instance/utmi.h"
#include "instance/wdt.h"
#include "instance/xdmac.h"

/* ************************************************************************** */
/*              PERIPHERAL ID DEFINITIONS FOR PIC32CZ2051CA70064              */
/* ************************************************************************** */
#define ID_SUPC          (  0) /* Supply Controller (SUPC) */
#define ID_RSTC          (  1) /* Reset Controller (RSTC) */
#define ID_RTC           (  2) /* Real-time Clock (RTC) */
#define ID_RTT           (  3) /* Real-time Timer (RTT) */
#define ID_WDT           (  4) /* Watchdog Timer (WDT) */
#define ID_PMC           (  5) /* Power Management Controller (PMC) */
#define ID_EFC           (  6) /* Embedded Flash Controller (EFC) */
#define ID_UART0         (  7) /* Universal Asynchronous Receiver Transmitter (UART0) */
#define ID_UART1         (  8) /* Universal Asynchronous Receiver Transmitter (UART1) */
#define ID_PIOA          ( 10) /* Parallel Input/Output Controller (PIOA) */
#define ID_PIOB          ( 11) /* Parallel Input/Output Controller (PIOB) */
#define ID_USART0        ( 13) /* Universal Synchronous Asynchronous Receiver Transmitter (USART0) */
#define ID_USART1        ( 14) /* Universal Synchronous Asynchronous Receiver Transmitter (USART1) */
#define ID_PIOD          ( 16) /* Parallel Input/Output Controller (PIOD) */
#define ID_TWIHS0        ( 19) /* Two-wire Interface High Speed (TWIHS0) */
#define ID_TWIHS1        ( 20) /* Two-wire Interface High Speed (TWIHS1) */
#define ID_SSC           ( 22) /* Synchronous Serial Controller (SSC) */
#define ID_TC0_CHANNEL0  ( 23) /* Timer Counter (TC0_CHANNEL0) */
#define ID_TC0_CHANNEL1  ( 24) /* Timer Counter (TC0_CHANNEL1) */
#define ID_TC0_CHANNEL2  ( 25) /* Timer Counter (TC0_CHANNEL2) */
#define ID_TC1_CHANNEL0  ( 26) /* Timer Counter (TC1_CHANNEL0) */
#define ID_TC1_CHANNEL1  ( 27) /* Timer Counter (TC1_CHANNEL1) */
#define ID_TC1_CHANNEL2  ( 28) /* Timer Counter (TC1_CHANNEL2) */
#define ID_AFEC0         ( 29) /* Analog Front-End Controller (AFEC0) */
#define ID_DACC          ( 30) /* Digital-to-Analog Converter Controller (DACC) */
#define ID_PWM0          ( 31) /* Pulse Width Modulation Controller (PWM0) */
#define ID_ICM           ( 32) /* Integrity Check Monitor (ICM) */
#define ID_ACC           ( 33) /* Analog Comparator Controller (ACC) */
#define ID_USBHS         ( 34) /* USB High-Speed Interface (USBHS) */
#define ID_MCAN0         ( 35) /* Controller Area Network (MCAN0) */
#define ID_GMAC          ( 39) /* Gigabit Ethernet MAC (GMAC) */
#define ID_AFEC1         ( 40) /* Analog Front-End Controller (AFEC1) */
#define ID_QSPI          ( 43) /* Quad Serial Peripheral Interface (QSPI) */
#define ID_UART2         ( 44) /* Universal Asynchronous Receiver Transmitter (UART2) */
#define ID_TC2_CHANNEL0  ( 47) /* Timer Counter (TC2_CHANNEL0) */
#define ID_TC2_CHANNEL1  ( 48) /* Timer Counter (TC2_CHANNEL1) */
#define ID_TC2_CHANNEL2  ( 49) /* Timer Counter (TC2_CHANNEL2) */
#define ID_TC3_CHANNEL0  ( 50) /* Timer Counter (TC3_CHANNEL0) */
#define ID_TC3_CHANNEL1  ( 51) /* Timer Counter (TC3_CHANNEL1) */
#define ID_TC3_CHANNEL2  ( 52) /* Timer Counter (TC3_CHANNEL2) */
#define ID_MLB           ( 53) /* MediaLB (MLB) */
#define ID_AES           ( 56) /* Advanced Encryption Standard (AES) */
#define ID_TRNG          ( 57) /* True Random Number Generator (TRNG) */
#define ID_XDMAC         ( 58) /* Extensible DMA Controller (XDMAC) */
#define ID_ISI           ( 59) /* Image Sensor Interface (ISI) */
#define ID_PWM1          ( 60) /* Pulse Width Modulation Controller (PWM1) */
#define ID_RSWDT         ( 63) /* Reinforced Safety Watchdog Timer (RSWDT) */

#define ID_PERIPH_MAX    ( 63) /* Number of peripheral IDs */

/* ************************************************************************** */
/*       REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CZ2051CA70064        */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define ACC_REGS                         ((acc_registers_t*)0x40044000)                /* ACC Registers Address        */
#define AES_REGS                         ((aes_registers_t*)0x4006c000)                /* AES Registers Address        */
#define AFEC0_REGS                       ((afec_registers_t*)0x4003c000)               /* AFEC0 Registers Address      */
#define AFEC1_REGS                       ((afec_registers_t*)0x40064000)               /* AFEC1 Registers Address      */
#define CHIPID_REGS                      ((chipid_registers_t*)0x400e0940)             /* CHIPID Registers Address     */
#define DACC_REGS                        ((dacc_registers_t*)0x40040000)               /* DACC Registers Address       */
#define EFC_REGS                         ((efc_registers_t*)0x400e0c00)                /* EFC Registers Address        */
#define GMAC_REGS                        ((gmac_registers_t*)0x40050000)               /* GMAC Registers Address       */
#define GPBR_REGS                        ((gpbr_registers_t*)0x400e1890)               /* GPBR Registers Address       */
#define ICM_REGS                         ((icm_registers_t*)0x40048000)                /* ICM Registers Address        */
#define ISI_REGS                         ((isi_registers_t*)0x4004c000)                /* ISI Registers Address        */
#define MATRIX_REGS                      ((matrix_registers_t*)0x40088000)             /* MATRIX Registers Address     */
#define MCAN0_REGS                       ((mcan_registers_t*)0x40030000)               /* MCAN0 Registers Address      */
#define MLB_REGS                         ((mlb_registers_t*)0x40068000)                /* MLB Registers Address        */
#define PIOA_REGS                        ((pio_registers_t*)0x400e0e00)                /* PIOA Registers Address       */
#define PIOB_REGS                        ((pio_registers_t*)0x400e1000)                /* PIOB Registers Address       */
#define PIOD_REGS                        ((pio_registers_t*)0x400e1400)                /* PIOD Registers Address       */
#define PMC_REGS                         ((pmc_registers_t*)0x400e0600)                /* PMC Registers Address        */
#define PWM0_REGS                        ((pwm_registers_t*)0x40020000)                /* PWM0 Registers Address       */
#define PWM1_REGS                        ((pwm_registers_t*)0x4005c000)                /* PWM1 Registers Address       */
#define QSPI_REGS                        ((qspi_registers_t*)0x4007c000)               /* QSPI Registers Address       */
#define RSTC_REGS                        ((rstc_registers_t*)0x400e1800)               /* RSTC Registers Address       */
#define RSWDT_REGS                       ((rswdt_registers_t*)0x400e1900)              /* RSWDT Registers Address      */
#define RTC_REGS                         ((rtc_registers_t*)0x400e1860)                /* RTC Registers Address        */
#define RTT_REGS                         ((rtt_registers_t*)0x400e1830)                /* RTT Registers Address        */
#define SSC_REGS                         ((ssc_registers_t*)0x40004000)                /* SSC Registers Address        */
#define SUPC_REGS                        ((supc_registers_t*)0x400e1810)               /* SUPC Registers Address       */
#define TC0_REGS                         ((tc_registers_t*)0x4000c000)                 /* TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0x40010000)                 /* TC1 Registers Address        */
#define TC2_REGS                         ((tc_registers_t*)0x40014000)                 /* TC2 Registers Address        */
#define TC3_REGS                         ((tc_registers_t*)0x40054000)                 /* TC3 Registers Address        */
#define TRNG_REGS                        ((trng_registers_t*)0x40070000)               /* TRNG Registers Address       */
#define TWIHS0_REGS                      ((twihs_registers_t*)0x40018000)              /* TWIHS0 Registers Address     */
#define TWIHS1_REGS                      ((twihs_registers_t*)0x4001c000)              /* TWIHS1 Registers Address     */
#define UART0_REGS                       ((uart_registers_t*)0x400e0800)               /* UART0 Registers Address      */
#define UART1_REGS                       ((uart_registers_t*)0x400e0a00)               /* UART1 Registers Address      */
#define UART2_REGS                       ((uart_registers_t*)0x400e1a00)               /* UART2 Registers Address      */
#define USART0_REGS                      ((usart_registers_t*)0x40024000)              /* USART0 Registers Address     */
#define USART1_REGS                      ((usart_registers_t*)0x40028000)              /* USART1 Registers Address     */
#define USBHS_REGS                       ((usbhs_registers_t*)0x40038000)              /* USBHS Registers Address      */
#define UTMI_REGS                        ((utmi_registers_t*)0x400e0400)               /* UTMI Registers Address       */
#define WDT_REGS                         ((wdt_registers_t*)0x400e1850)                /* WDT Registers Address        */
#define XDMAC_REGS                       ((xdmac_registers_t*)0x40078000)              /* XDMAC Registers Address      */
#define GPNVMBITS_REGS                   ((fuses_gpnvmbits_registers_t*)0x00000000)    /* FUSES Registers Address      */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* ************************************************************************** */
/*              BASE ADDRESS DEFINITIONS FOR PIC32CZ2051CA70064               */
/* ************************************************************************** */
#define ACC_BASE_ADDRESS                 _UINT32_(0x40044000)                          /* ACC Base Address */
#define AES_BASE_ADDRESS                 _UINT32_(0x4006c000)                          /* AES Base Address */
#define AFEC0_BASE_ADDRESS               _UINT32_(0x4003c000)                          /* AFEC0 Base Address */
#define AFEC1_BASE_ADDRESS               _UINT32_(0x40064000)                          /* AFEC1 Base Address */
#define CHIPID_BASE_ADDRESS              _UINT32_(0x400e0940)                          /* CHIPID Base Address */
#define DACC_BASE_ADDRESS                _UINT32_(0x40040000)                          /* DACC Base Address */
#define EFC_BASE_ADDRESS                 _UINT32_(0x400e0c00)                          /* EFC Base Address */
#define GMAC_BASE_ADDRESS                _UINT32_(0x40050000)                          /* GMAC Base Address */
#define GPBR_BASE_ADDRESS                _UINT32_(0x400e1890)                          /* GPBR Base Address */
#define ICM_BASE_ADDRESS                 _UINT32_(0x40048000)                          /* ICM Base Address */
#define ISI_BASE_ADDRESS                 _UINT32_(0x4004c000)                          /* ISI Base Address */
#define MATRIX_BASE_ADDRESS              _UINT32_(0x40088000)                          /* MATRIX Base Address */
#define MCAN0_BASE_ADDRESS               _UINT32_(0x40030000)                          /* MCAN0 Base Address */
#define MLB_BASE_ADDRESS                 _UINT32_(0x40068000)                          /* MLB Base Address */
#define PIOA_BASE_ADDRESS                _UINT32_(0x400e0e00)                          /* PIOA Base Address */
#define PIOB_BASE_ADDRESS                _UINT32_(0x400e1000)                          /* PIOB Base Address */
#define PIOD_BASE_ADDRESS                _UINT32_(0x400e1400)                          /* PIOD Base Address */
#define PMC_BASE_ADDRESS                 _UINT32_(0x400e0600)                          /* PMC Base Address */
#define PWM0_BASE_ADDRESS                _UINT32_(0x40020000)                          /* PWM0 Base Address */
#define PWM1_BASE_ADDRESS                _UINT32_(0x4005c000)                          /* PWM1 Base Address */
#define QSPI_BASE_ADDRESS                _UINT32_(0x4007c000)                          /* QSPI Base Address */
#define RSTC_BASE_ADDRESS                _UINT32_(0x400e1800)                          /* RSTC Base Address */
#define RSWDT_BASE_ADDRESS               _UINT32_(0x400e1900)                          /* RSWDT Base Address */
#define RTC_BASE_ADDRESS                 _UINT32_(0x400e1860)                          /* RTC Base Address */
#define RTT_BASE_ADDRESS                 _UINT32_(0x400e1830)                          /* RTT Base Address */
#define SSC_BASE_ADDRESS                 _UINT32_(0x40004000)                          /* SSC Base Address */
#define SUPC_BASE_ADDRESS                _UINT32_(0x400e1810)                          /* SUPC Base Address */
#define TC0_BASE_ADDRESS                 _UINT32_(0x4000c000)                          /* TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UINT32_(0x40010000)                          /* TC1 Base Address */
#define TC2_BASE_ADDRESS                 _UINT32_(0x40014000)                          /* TC2 Base Address */
#define TC3_BASE_ADDRESS                 _UINT32_(0x40054000)                          /* TC3 Base Address */
#define TRNG_BASE_ADDRESS                _UINT32_(0x40070000)                          /* TRNG Base Address */
#define TWIHS0_BASE_ADDRESS              _UINT32_(0x40018000)                          /* TWIHS0 Base Address */
#define TWIHS1_BASE_ADDRESS              _UINT32_(0x4001c000)                          /* TWIHS1 Base Address */
#define UART0_BASE_ADDRESS               _UINT32_(0x400e0800)                          /* UART0 Base Address */
#define UART1_BASE_ADDRESS               _UINT32_(0x400e0a00)                          /* UART1 Base Address */
#define UART2_BASE_ADDRESS               _UINT32_(0x400e1a00)                          /* UART2 Base Address */
#define USART0_BASE_ADDRESS              _UINT32_(0x40024000)                          /* USART0 Base Address */
#define USART1_BASE_ADDRESS              _UINT32_(0x40028000)                          /* USART1 Base Address */
#define USBHS_BASE_ADDRESS               _UINT32_(0x40038000)                          /* USBHS Base Address */
#define UTMI_BASE_ADDRESS                _UINT32_(0x400e0400)                          /* UTMI Base Address */
#define WDT_BASE_ADDRESS                 _UINT32_(0x400e1850)                          /* WDT Base Address */
#define XDMAC_BASE_ADDRESS               _UINT32_(0x40078000)                          /* XDMAC Base Address */
#define GPNVMBITS_BASE_ADDRESS           _UINT32_(0x00000000)                          /* FUSES Base Address */

/* ************************************************************************** */
/*                   PIO DEFINITIONS FOR PIC32CZ2051CA70064                   */
/* ************************************************************************** */
#include "pio/pic32cz2051ca70064.h"

/* ************************************************************************** */
/*             MEMORY MAPPING DEFINITIONS FOR PIC32CZ2051CA70064              */
/* ************************************************************************** */
#define PERIPHERALS_SIZE               _UINT32_(0x20000000)    /* 524288kB Memory segment type: io */
#define SYSTEM_SIZE                    _UINT32_(0x10000000)    /* 262144kB Memory segment type: io */
#define QSPIMEM_SIZE                   _UINT32_(0x20000000)    /* 524288kB Memory segment type: other */
#define AXIMX_SIZE                     _UINT32_(0x00100000)    /* 1024kB Memory segment type: other */
#define ITCM_SIZE                      _UINT32_(0x00020000)    /*  128kB Memory segment type: other */
#define IFLASH_SIZE                    _UINT32_(0x00200000)    /* 2048kB Memory segment type: flash */
#define IFLASH_PAGE_SIZE               _UINT32_(       512)
#define IFLASH_NB_OF_PAGES             _UINT32_(      4096)

#define IROM_SIZE                      _UINT32_(0x00004000)    /*   16kB Memory segment type: rom */
#define DTCM_SIZE                      _UINT32_(0x00020000)    /*  128kB Memory segment type: other */
#define IRAM_SIZE                      _UINT32_(0x00080000)    /*  512kB Memory segment type: ram */

