zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/include/pic32cz2051ca70064.h
#define PERIPHERALS_ADDR               _UINT32_(0x40000000)    /* PERIPHERALS base address (type: io)*/
#define SYSTEM_ADDR                    _UINT32_(0xe0000000)    /* SYSTEM base address (type: io)*/
#define QSPIMEM_ADDR                   _UINT32_(0x80000000)    /* QSPIMEM base address (type: other)*/
#define AXIMX_ADDR                     _UINT32_(0xa0000000)    /* AXIMX base address (type: other)*/
#define ITCM_ADDR                      _UINT32_(0x00000000)    /* ITCM base address (type: other)*/
#define IFLASH_ADDR                    _UINT32_(0x00400000)    /* IFLASH base address (type: flash)*/
#define IROM_ADDR                      _UINT32_(0x00800000)    /* IROM base address (type: rom)*/
#define DTCM_ADDR                      _UINT32_(0x20000000)    /* DTCM base address (type: other)*/
#define IRAM_ADDR                      _UINT32_(0x20400000)    /* IRAM base address (type: ram)*/

/* ************************************************************************** */
/*                  DEVICE SIGNATURES FOR PIC32CZ2051CA70064                  */
/* ************************************************************************** */
#define CHIP_JTAGID                    _UINT32_(0X05B3D03F)
#define CHIP_CIDR                      _UINT32_(0XA1AF0E00)
#define CHIP_EXID                      _UINT32_(0X00000000)

/* ************************************************************************** */
/*               ELECTRICAL DEFINITIONS FOR PIC32CZ2051CA70064                */
/* ************************************************************************** */
#define CHIP_FREQ_SLCK_RC_MIN          _UINT32_(20000)     
#define CHIP_FREQ_SLCK_RC              _UINT32_(32000)     /* Typical Slow Clock Internal RC frequency */
#define CHIP_FREQ_SLCK_RC_MAX          _UINT32_(44000)     
#define CHIP_FREQ_MAINCK_RC_4MHZ       _UINT32_(4000000)   
#define CHIP_FREQ_MAINCK_RC_8MHZ       _UINT32_(8000000)   
#define CHIP_FREQ_MAINCK_RC_12MHZ      _UINT32_(12000000)  
#define CHIP_FREQ_CPU_MAX              _UINT32_(300000000) 
#define CHIP_FREQ_XTAL_32K             _UINT32_(32768)     
#define CHIP_FREQ_XTAL_12M             _UINT32_(12000000)  
#define CHIP_FREQ_FWS_0                _UINT32_(23000000)  /* Maximum operating frequency when FWS is 0 */
#define CHIP_FREQ_FWS_1                _UINT32_(46000000)  /* Maximum operating frequency when FWS is 1 */
#define CHIP_FREQ_FWS_2                _UINT32_(69000000)  /* Maximum operating frequency when FWS is 2 */
#define CHIP_FREQ_FWS_3                _UINT32_(92000000)  /* Maximum operating frequency when FWS is 3 */
#define CHIP_FREQ_FWS_4                _UINT32_(115000000) /* Maximum operating frequency when FWS is 4 */
#define CHIP_FREQ_FWS_5                _UINT32_(138000000) /* Maximum operating frequency when FWS is 5 */
#define CHIP_FREQ_FWS_6                _UINT32_(150000000) /* Maximum operating frequency when FWS is 6 */
#define CHIP_FREQ_FWS_NUMBER           _UINT32_(7)         /* Number of FWS ranges */

#ifdef __cplusplus
}
#endif

#endif /* _PIC32CZ2051CA70064_H_ */

